NextFOAM-2506/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0.orig/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    region0_to_pyrolysisRegion_coupledWall
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }

    frontAndBack
    {
        type            cyclic;
    }

    ".*"
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }
}


// ************************************************************************* //
